---
kind: type
id: T:Autodesk.Revit.DB.Electrical.CableTraySizeIterator
source: html/474b13d0-1543-32d8-bb41-205d8cdd449f.htm
---
# Autodesk.Revit.DB.Electrical.CableTraySizeIterator

An iterator to a set of MEP cable tray sizes from CableTraySizes.

## Syntax (C#)
```csharp
public class CableTraySizeIterator : IEnumerator<MEPSize>
```